[
	{
		"content":"I had a long history of neck problems and headaches. After failed attempts through many different therapists, Karen was recommended to me by a friend. After only three treatments, I felt much better. She does a terrific job, I would recommend her to anyone.",
		"poster":  "Leo J. Burggraff",
		"profession": "Rancher/Farmer"
	},
	{
		"content":"I originally went to Karen for knee and foot problems, but I soon noticed the improvements in my digestive tract. I had been suffering from digestive problems and colitis for almost 50 years. My health has improved and I feel relaxed and peaceful. Reflexology is wonderful for the nervous system. Her treatments are outstanding. She is personable, loving, knowledgeable, and so technically skilled,she is always right on target.",
		"poster": "Sally Denigan",
		"profession": "Retired Teacher"
	},
	{
		"content":"I suffered with pain in my whole body. The weekly treatments on my toes and feet changed my health, and got my seventy-four year old body to function much better. Karen, thank you for your excellent knowledge and know how.",
		"poster": "Everett Wild",
		"profession": "Retired Construction Worker"
	},
 	{
		"content":"Hi Karen! Thank you I believe you helped me tremendously! It was amazing how it all turned out. We went in Friday morning, planning on being induced since nothing happened, I walked into the hospital; they took me to our laboring room and asked me to get into a hospital gown. At this point, I had no contractions. By the time the nurse came back into the room, I was having painful contractions & the Dr.checked me. I was 6 cm! Within 1 hour, I was at 9 cm! Pushed for 1/2 hour & she was here!  I really want to thank you for fitting me in your schedule that week. I feel that the treatment I received from you helped her move along & be born without being induced. See you at my next appt!",
		"poster": "Annie Beck",
		"profession": "Nurse",
		"note": "this client's first child was medically induced."
	},
	{
		"content":"Dear Karen, It has been a little over a month and a half since Josh (age 13) had his first Reflexology treatment with you. During this period, both subtle and immediate changes have been noticed. When I brought Josh to see you,our main concern was his inability to focus on school work and remain still. It was recommended by a school psychologist the problem could be Attention Deficit Disorder, and having a medication prescribed -Ritalin. Not at all comfortable with their suggestion, we came to you. After 3 weeks of treatment, I received a call from a special education teacher at Josh's school. She wanted to know when we started Josh on the medication. There had been a noticeable difference in his behavior by one of his teachers. I was pleased to tell him, he was not on a chemical medication. Thank you.",
		"poster": "Marlene Yates"
	}

]   